{"backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"trainable": false, "padding": [[0, 1], [0, 1]], "name": "conv1_pad", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"strides": [2, 2], "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv1", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv1_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv1_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_1", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_1_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_1_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_1", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_1_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_1_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_pad_2", "class_name": "ZeroPadding2D", "config": {"trainable": false, "padding": [[0, 1], [0, 1]], "name": "conv_pad_2", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "name": "conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "padding": "valid", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_2", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_2_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_2_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_2", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_2_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_2_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_3", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_3_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_3_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_3", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_3_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_3_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_pad_4", "class_name": "ZeroPadding2D", "config": {"trainable": false, "padding": [[0, 1], [0, 1]], "name": "conv_pad_4", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "name": "conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "padding": "valid", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_4", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_4_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_4_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_4", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_4_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_4_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_5", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_5_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_5_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_5", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_5_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_5_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_pad_6", "class_name": "ZeroPadding2D", "config": {"trainable": false, "padding": [[0, 1], [0, 1]], "name": "conv_pad_6", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "name": "conv_dw_6", "class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "padding": "valid", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_6", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_6_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_6_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_6", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_6_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_6_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_7", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_7_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_7_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_7", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_7_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_7_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_8", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_8_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_8_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_8", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_8_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_8_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_9", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_9_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_9_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_9", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_9_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_pw_9_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_10", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_10_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "class_name": "ReLU", "config": {"trainable": false, "name": "conv_dw_10_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_10", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_10_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_10_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_11", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_11_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu", "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_11_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_11", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_11_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu", "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_11_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_pad_12", "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv_pad_12", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "name": "conv_dw_12", "class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "padding": "valid", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_12", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_12_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu", "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_12_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_12", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1024, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_12_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu", "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_12_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv_dw_13", "kernel_size": [3, 3], "depthwise_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depth_multiplier": 1}}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_13_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu", "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_13_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv_pw_13", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1024, "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_13_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu", "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_13_relu", "negative_slope": 0.0, "threshold": 0.0, "max_value": 6.0}}, {"inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "trainable": true, "activation": "softmax", "kernel_regularizer": null, "units": 43, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model"}